{"created_at_utc":"2026-01-11T09:19:27Z","d3_version":"0.1","schema_version":"0.1","threats":[{"containment":["Enforce GDVS flow: commit -> seal -> verify -> pytest; reject dirty-tree seals.","Protect canonical paths (gdvs/, seals/, scripts/verify_*) via CODEOWNERS/review."],"description":"Legitimate contributor attempts subtle drift or policy weakening while preserving apparent functionality.","detection":["Require PR-only changes for governance/policy artifacts; block direct-to-main.","Run pytest + verify_repo_seals in pre-push and CI; fail on any WARN/FAIL."],"id":"D3-T01","name":"Insider Guardian Attack","recovery":["Rollback to last sealed good HEAD; re-run D1-D3; re-seal corrected head.","Invalidate compromised seals by re-keying signer and re-anchoring epoch if needed."]},{"containment":["Pin dev tools in requirements-dev.txt; prohibit implicit global pytest usage.","Use isolated venv per repo; never run governance checks from global Python."],"description":"Modified Python/pip/git behavior or compromised environment alters outputs or verification results.","detection":["Run scripts/verify_environment.py; treat WARN as blocking in D2/D3 gates.","Cold-clone proof: venv install + verify_repo_seals + pytest must pass."],"id":"D3-T02","name":"Toolchain Poisoning","recovery":["Rebuild venv from scratch (delete .venv); reinstall from requirements-dev.txt; rerun proofs.","If system Python suspect, reinstall Python and re-verify cryptographic libs and PATH."]},{"containment":["Disallow force-push on protected branches; require linear history rules where possible.","Record epoch anchor + head in A9 output; fail if anchor regresses."],"description":"Replay of old seals/epochs or rollback attempts to reintroduce previously valid artifacts.","detection":["Verify latest epoch anchor tag and verify_epoch_anchor.py in CI.","Seal verification must target introduced seal hash12; reject mismatched head/target."],"id":"D3-T03","name":"Time-Shift Attacks","recovery":["Recreate epoch anchor from last known-good commit; re-run verify_epoch_anchor.py.","Reissue missing seals for any commits between anchor and head; rerun A9."]},{"containment":["Prefer lockfiles when introduced; forbid unpinned new deps without review + D2 proof.","Keep canonical JSON writer for on-disk artifacts to avoid byte drift."],"description":"Same dependency name/version resolves to different behavior across installs or time.","detection":["Cold-clone dependency install must match expected behavior; rerun twice to detect drift.","Track deterministic tree hash x2; mismatch triggers ALERT investigation."],"id":"D3-T04","name":"Supply-Chain Shape-Shifting","recovery":["Re-pin or replace drifting dependency; regenerate venv; rerun D2 clone proof.","If drift persists, quarantine dependency and require reproducible source verification."]}]}
